ExchangePlans/ОбменДанными2K_CRSБухгалтерия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<ExchangePlan>
		<Properties>
			<Name>ОбменДанными2K_CRSБухгалтерия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбъектовВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСвязейМеждуБазамиРС</Name>
					<Comment>Настройки которые определяют роли информационных баз в структуре узлов обмена, и в этой зависимости будут определятся к миграции необходимые данные.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаНастройки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗначимостиОбъекта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникДанныхОбъекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыБазИсточниковПриОбменеЦРС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/ОбменДанными2K_CRSБухгалтерия/Forms/ФормаУзла/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Состав = Метаданные.ПланыОбмена.ОбменДанными2K_CRS.Состав;
	СписокСоставаПоПолномуИмени = Новый Массив;
	Для каждого ЭлСостава Из Состав Цикл
		МДЭлемента = ЭлСостава.Метаданные;
		СписокСоставаПоПолномуИмени.Добавить(МДЭлемента.ПолноеИмя());
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСоставаПоПолномуИмени", СписокСоставаПоПолномуИмени);
	Запрос.УстановитьПараметр("УзелОбмена", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка
	|ПОМЕСТИТЬ ИдентификаторыМД
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя В(&СписокСоставаПоПолномуИмени)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыМД.Ссылка,
	|	ВЗУзелОбмена.ИдентификаторОбъектаНастройки
	|ИЗ
	|	ИдентификаторыМД КАК ИдентификаторыМД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОбменДанными.ИдентификаторОбъектаНастройки КАК ИдентификаторОбъектаНастройки
	|		ИЗ
	|			ПланОбмена.ОбменДанными2K_CRS.НастройкиСвязейМеждуБазамиРС КАК ОбменДанными
	|		ГДЕ
	|			ОбменДанными.Ссылка = &УзелОбмена) КАК ВЗУзелОбмена
	|		ПО ИдентификаторыМД.Ссылка = ВЗУзелОбмена.ИдентификаторОбъектаНастройки
	|ГДЕ
	|	ВЗУзелОбмена.ИдентификаторОбъектаНастройки ЕСТЬ NULL ";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НС = Объект.НастройкиСвязейМеждуБазамиРС.Добавить();
		НС.ИдентификаторОбъектаНастройки = ВыборкаДетальныеЗаписи.Ссылка
		
	КонецЦикла;
	
	Объект.НастройкиСвязейМеждуБазамиРС.Сортировать("ИсточникДанныхОбъекта Убыв, ИдентификаторОбъектаНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбщуюФорму(Команда)
	ОткрытьФорму("ПланОбмена.ОбменДанными2K_CRS.Форма.ФормаОбъектаУпр") 
КонецПроцедуры
